42/data/attachments/12e2c3c023b64faa.txt

INFO     root:api_helper.py:33 Пользователь Jasmine Sanford зарегистрирован
INFO     root:api_helper.py:33 Пользователь Helen Benson зарегистрирован
INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "392"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jasmine Sanford</nif:username>
            <nif:friendToBeRequested>Helen Benson</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "416",
  "Date": "Tue, 24 Jun 2025 03:26:45 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>32742e50-c3b8-4b55-8a00-150c56888f87</ns2:id><ns2:username>Helen Benson</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>INVITE_SENT</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "388"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>Helen Benson</nif:username>
            <nif:friendToBeAdded>Jasmine Sanford</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "414",
  "Date": "Tue, 24 Jun 2025 03:26:45 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>18bd1b32-f064-404e-b0d8-ae8bf0aff1bf</ns2:id><ns2:username>Jasmine Sanford</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>FRIEND</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "379"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsRequest>
            <nif:username>Jasmine Sanford</nif:username>
            <!--Optional:-->
            <nif:searchQuery></nif:searchQuery>
        </nif:friendsRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "413",
  "Date": "Tue, 24 Jun 2025 03:26:45 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:usersResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>32742e50-c3b8-4b55-8a00-150c56888f87</ns2:id><ns2:username>Helen Benson</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>FRIEND</ns2:friendshipStatus></ns2:user></ns2:usersResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "384"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:removeFriendRequest>
            <nif:username>Jasmine Sanford</nif:username>
            <nif:friendToBeRemoved>Helen Benson</nif:friendToBeRemoved>
        </nif:removeFriendRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Content-Length": "0",
  "Date": "Tue, 24 Jun 2025 03:26:45 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY None


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "379"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsRequest>
            <nif:username>Jasmine Sanford</nif:username>
            <!--Optional:-->
            <nif:searchQuery></nif:searchQuery>
        </nif:friendsRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "196",
  "Date": "Tue, 24 Jun 2025 03:26:45 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:usersResponse xmlns:ns2="niffler-userdata"/></SOAP-ENV:Body></SOAP-ENV:Envelope>'